

/*

파이썬은 c나 자바와 같이 컴파일 방식의 언어가 아니라 스크립트 언어이다. (명령어를 작성해 놓은 txt파일을 스크립트라고 한다.)
따라서 문법이 간단해 배우기 쉽고 개발 절차가 단순해 짧은 시간에 원하는 프로그램을 신속하게 만들 수 있다.
그러나 단순함으로 인해 성능은 떨어지는 단점이 있지만 생산성이 높다는 장점도 있다.

c와 자바같은 컴파일 방식은 모든 명령을 한꺼번에 번역해 놓고 일괄 실행한다. 그렇기에 컴퓨터가 바로 실행할 수 있는 완벽한 실행 파일을미리 만들어 놓고 시작하기에 속도가 빠르다.
반면 인터프리터 방식의 언어는 명령어를 만날때마다 즉시 번역해서 실행하기에 속도가 느리다. ex) python
또한 그렇기 때문에 인터프리터 방식의 언어는 대화식으로 실행된다고 할 수 있다.


파이썬과 같은 인터프리터 방식의 스크립트 언어는 전통적인 컴파일 언어와 다른 특징이 있다.

특징
1)성능이 느리지만 생산성이 좋다
2)플랫폼에 독립적이기에 어느 os에서나 사용 가능하다. 그렇기에 이기종 간의 통신 환경 웹에 유리하다.
3)실무에 필요한 고급 라이브러리를 대거 포함하고 있어 기본 패키지만 있어도 웬만한 작업이 모두 처리가능하다.
4)객체지향적이며 클래스를 지원한다.



*/